window.jl_i18n = {
	lang:{
		'error' : 'Помилка!',
		'require_all_fields': 'Перевірте чи всі поля правильно заповнені.',
		'reload_page_and_try_again': 'Будь ласка, перезавантажте сторінку і спробуйте ще раз.',
		'error_reload_and_download': 'Будь ласка, спробуйте перезавантажити сторінку і ще раз скачати файл.',
		'error_reload_and': 'Помилка! Будь ласка, спробуйте перезавантажити сторінку і ...',
		'error_reload_and_repeat': 'Помилка! Будь ласка, спробуйте перезавантажити сторінку і повторити дію.',
		'alf': 'абвгґдеєжзиіїйклмнопрстуфхцчшщьюя',
		'added': 'додано!',
		'search': 'Пошук',
		'at_least_one_site': 'Оберіть хоча б один сайт для пошуку',
		'error_reload_and_repeat': 'Будь ласка, спробуйте перезавантажити сторінку і повторити пошук.',
		'delete_user': 'Ви не зможете користуватися кабінетом. Ви впевнені, що хочете видалити Ваш обліковий запис?',
		'email_error': 'Введіть коректний імейл',
	},
	translate: function(key){
		return typeof this.lang[key] != 'undefined' ? this.lang[key] : key;
	}
}